/**
    [ JS 실습1 ]
    -빽다방의 키오스크에서의 존재하는 자료들을 찾아서 작성하시오.
    -찾을 자료형 종류
    
        숫자 자료 : 3개 이상
            가격(2000) ,
            대기번호(121) , 
            주문수량(6)

        문자열 자료 : 3개 이상
            카테고리란(커피, 음료, 주스) , 
            결제방식란(신용카드, 카카오페이, 네이버 페이) , 
            안내페이지(메뉴 확인, 결제 확인, 메뉴 추가 확인 등), 
            영수증(지점명,품명 등)
            적립 휴대폰 번호 (010-0000-0000) ------(-하이푼 들어가면 문자로 가야함)

        불리언 자료 : 3개 이상
            영수증 발급 여부 (예, 아니오) , 
            각얼음 간얼음 - , ICE HOT ,
            쿠폰사용여부, 
            
        배열 자료 : 3개 이상
            유료옵션 , 
            카테고리 내 음료들 , 
            카테고리종류(카테고리 문자열들이 모여)
*/

console.log( " 숫자 자료 : 가격 , 대기번호 , 주문수량 ");
console.log( " 문자열 자료 : 카테고리란 , 결제방식란 , 안내페이지 , 영수증 , 적립 휴대폰 번호 ");
console.log( " 불리언 자료 : 영수증 발급 여부 (예/아니오) , 각얼음 / 간얼음 , ICE / HOT , 쿠폰 사용 여부 ");
console.log( " 배열 자료 : 유료옵션 , 카테고리 내 음료들 , 카테고리 종류" );